let AffixList=[{
    id:1,
    main:["生命值"],
    sub:['生命值%數','攻擊力','攻擊力%數','防禦力','防禦力%數','速度', '暴擊率', '暴擊傷害', '效果抗性', '效果命中', '擊破特攻']   
},{
    id:2,
    main:["攻擊力"],
    sub:['生命值','生命值%數','攻擊力%數','防禦力','防禦力%數','速度', '暴擊率', '暴擊傷害', '效果抗性', '效果命中', '擊破特攻']
},{
    id:3,
    main: ["攻擊力%數", "生命值%數", "防禦力%數", "暴擊率", "暴擊傷害", "治療量加成", "效果命中"],
    sub:['生命值','生命值%數','攻擊力','攻擊力%數','防禦力','防禦力%數','速度', '暴擊率', '暴擊傷害', '效果抗性', '效果命中', '擊破特攻']
},{
    id:4,
    main: ["攻擊力%數", "生命值%數", "防禦力%數", "速度"],
    sub: ['生命值','生命值%數','攻擊力','攻擊力%數','防禦力','防禦力%數','速度', '暴擊率', '暴擊傷害', '效果抗性', '效果命中', '擊破特攻']
},{
    id:5,
    main:["攻擊力%數", "生命值%數", "防禦力%數", "物理屬性傷害提高", "火屬性傷害提高", "冰屬性傷害提高", "雷屬性傷害提高", "風屬性傷害提高", "量子屬性傷害提高", "虛數屬性傷害提高"],
    sub:['生命值','生命值%數','攻擊力','攻擊力%數','防禦力','防禦力%數','速度', '暴擊率', '暴擊傷害', '效果抗性', '效果命中', '擊破特攻']
},{
    id:6,
    main: ["攻擊力%數", "生命值%數", "防禦力%數", "擊破特攻","能量恢復效率"],
    sub: ['生命值','生命值%數','攻擊力','攻擊力%數','防禦力','防禦力%數','速度', '暴擊率', '暴擊傷害', '效果抗性', '效果命中', '擊破特攻']
},{
    id:7,
    main: [],
    sub: [
        '生命值%數','攻擊力%數','防禦力%數','速度', '暴擊率', '暴擊傷害', '效果抗性', '效果命中', '擊破特攻',"能量恢復效率","治療量加成",
        "物理屬性傷害提高", "火屬性傷害提高", "冰屬性傷害提高", "雷屬性傷害提高", "風屬性傷害提高", "量子屬性傷害提高", "虛數屬性傷害提高"
    ]
}]


export default AffixList;